load-tests/order-load-test.yml
config:
  target: 'http://localhost:8082'
  phases:
    - duration: 60
      arrivalRate: 3
      name: "Warm up"
    - duration: 120
      arrivalRate: 8
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 15
      name: "Sustained load"
    - duration: 60
      arrivalRate: 3
      name: "Cool down"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Order Creation and Retrieval"
    weight: 70
    flow:
      - post:
          url: "/api/orders"
          json:
            userId: "{{ $randomInt(1, 100) }}"
            items:
              - productId: "{{ $randomString() }}"
                quantity: "{{ $randomInt(1, 5) }}"
                price: "{{ $randomInt(10, 500) }}.99"
            deliveryAddress: "Rua Teste {{ $randomInt(1, 999) }}, São Paulo, SP"
            paymentMethod: "{{ $pick(['CREDIT_CARD', 'DEBIT_CARD', 'PIX']) }}"
          capture:
            - json: "$.id"
              as: "orderId"
      - think: 2
      - get:
          url: "/api/orders/{{ orderId }}"

  - name: "Order Listing"
    weight: 20
    flow:
      - get:
          url: "/api/orders"
          qs:
            page: "{{ $randomInt(0, 5) }}"
            size: "10"
      - think: 1
      - get:
          url: "/api/orders/user/{{ $randomInt(1, 100) }}"

  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/actuator/health"
      - get:
          url: "/actuator/metrics"